convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/Cdelete.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:DebuggingHeader>
         <!--type: {urn:partner.soap.sforce.com}DebugLevel - enumeration: [None,DebugOnly,Db]-->
         <urn:debugLevel>$(HEADER_DEBUGGINGHEADER_DEBUGLEVEL)</urn:debugLevel>
      </urn:DebuggingHeader>
      <urn:AllOrNoneHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:allOrNone>$(HEADER_ALLORNONEHEADER_ALLORNONE)</urn:allOrNone>
      </urn:AllOrNoneHeader>
      <urn:StreamingEnabledHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:streamingEnabled>$(HEADER_STREAMINGENABLEDHEADER_STREAMINGENABLED)</urn:streamingEnabled>
      </urn:StreamingEnabledHeader>
      <urn:DisableFeedTrackingHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:disableFeedTracking>$(HEADER_DISABLEFEEDTRACKINGHEADER_DISABLEFEEDTRACKING)</urn:disableFeedTracking>
      </urn:DisableFeedTrackingHeader>
      <urn:AllowFieldTruncationHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:allowFieldTruncation>$(HEADER_ALLOWFIELDTRUNCATIONHEADER_ALLOWFIELDTRUNCATION)</urn:allowFieldTruncation>
      </urn:AllowFieldTruncationHeader>
      <urn:EmailHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerAutoResponseEmail>$(HEADER_EMAILHEADER_TRIGGERAUTORESPONSEEMAIL)</urn:triggerAutoResponseEmail>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerOtherEmail>$(HEADER_EMAILHEADER_TRIGGEROTHEREMAIL)</urn:triggerOtherEmail>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerUserEmail>$(HEADER_EMAILHEADER_TRIGGERUSEREMAIL)</urn:triggerUserEmail>
      </urn:EmailHeader>
      <urn:UserTerritoryDeleteHeader>
         <!--type: {urn:partner.soap.sforce.com}ID-->
         <urn:transferToUserId>$(HEADER_USERTERRITORYDELETEHEADER_TRANSFERTOUSERID)</urn:transferToUserId>
      </urn:UserTerritoryDeleteHeader>
      <urn:PackageVersionHeader>
         <!--Zero or more repetitions:-->
         <urn:packageVersions>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:majorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MAJORNUMBER)</urn:majorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:minorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MINORNUMBER)</urn:minorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:namespace>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_NAMESPACE)</urn:namespace>
         </urn:packageVersions>
      </urn:PackageVersionHeader>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:delete>
         <!--Zero or more repetitions:-->
         <!--type: {urn:partner.soap.sforce.com}ID-->
         <urn:ids>$(BODY_DELETE_IDS)</urn:ids>
      </urn:delete>
   </soapenv:Body>
</soapenv:Envelope>